Masmiseim36/Kinetis/targets/Kinetis/CMSIS/MK10N512MD100.h
/*! LPTMR - Register Layout Typedef */
typedef struct {
  __IO uint32_t CSR;                               /*!< Low Power Timer Control Status Register, offset: 0x0 */
  __IO uint32_t PSR;                               /*!< Low Power Timer Prescale Register, offset: 0x4 */
  __IO uint32_t CMR;                               /*!< Low Power Timer Compare Register, offset: 0x8 */
  __I  uint32_t CNR;                               /*!< Low Power Timer Counter Register, offset: 0xC */
} LPTMR_Type;

/* ----------------------------------------------------------------------------
   -- LPTMR Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup LPTMR_Register_Masks LPTMR Register Masks */
/*! \{ */

/* CSR Bit Fields */
#define LPTMR_CSR_TEN_MASK                       0x1u
#define LPTMR_CSR_TEN_SHIFT                      0
#define LPTMR_CSR_TMS_MASK                       0x2u
#define LPTMR_CSR_TMS_SHIFT                      1
#define LPTMR_CSR_TFC_MASK                       0x4u
#define LPTMR_CSR_TFC_SHIFT                      2
#define LPTMR_CSR_TPP_MASK                       0x8u
#define LPTMR_CSR_TPP_SHIFT                      3
#define LPTMR_CSR_TPS_MASK                       0x30u
#define LPTMR_CSR_TPS_SHIFT                      4
#define LPTMR_CSR_TPS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_CSR_TPS_SHIFT))&LPTMR_CSR_TPS_MASK)
#define LPTMR_CSR_TIE_MASK                       0x40u
#define LPTMR_CSR_TIE_SHIFT                      6
#define LPTMR_CSR_TCF_MASK                       0x80u
#define LPTMR_CSR_TCF_SHIFT                      7
/* PSR Bit Fields */
#define LPTMR_PSR_PCS_MASK                       0x3u
#define LPTMR_PSR_PCS_SHIFT                      0
#define LPTMR_PSR_PCS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PCS_SHIFT))&LPTMR_PSR_PCS_MASK)
#define LPTMR_PSR_PBYP_MASK                      0x4u
#define LPTMR_PSR_PBYP_SHIFT                     2
#define LPTMR_PSR_PRESCALE_MASK                  0x78u
#define LPTMR_PSR_PRESCALE_SHIFT                 3
#define LPTMR_PSR_PRESCALE(x)                    (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PRESCALE_SHIFT))&LPTMR_PSR_PRESCALE_MASK)
/* CMR Bit Fields */
#define LPTMR_CMR_COMPARE_MASK                   0xFFFFu
#define LPTMR_CMR_COMPARE_SHIFT                  0
#define LPTMR_CMR_COMPARE(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CMR_COMPARE_SHIFT))&LPTMR_CMR_COMPARE_MASK)
/* CNR Bit Fields */
#define LPTMR_CNR_COUNTER_MASK                   0xFFFFu
#define LPTMR_CNR_COUNTER_SHIFT                  0
#define LPTMR_CNR_COUNTER(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CNR_COUNTER_SHIFT))&LPTMR_CNR_COUNTER_MASK)

/*! \} */ /* end of group LPTMR_Register_Masks */


/* LPTMR - Peripheral instance base addresses */
/*! Peripheral LPTMR0 base address */
#define LPTMR0_BASE                              (0x40040000u)
/*! Peripheral LPTMR0 base pointer */
#define LPTMR0                                   ((LPTMR_Type *)LPTMR0_BASE)

/*! \} */ /* end of group LPTMR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*! \addtogroup MC_Peripheral_Access_Layer MC Peripheral Access Layer */
/*! \{ */

/*! MC - Register Layout Typedef */
typedef struct {
  __I  uint8_t SRSH;                               /*!< System Reset Status Register High, offset: 0x0 */
  __I  uint8_t SRSL;                               /*!< System Reset Status Register Low, offset: 0x1 */
  __IO uint8_t PMPROT;                             /*!< Power Mode Protection Register, offset: 0x2 */
  __IO uint8_t PMCTRL;                             /*!< Power Mode Control Register, offset: 0x3 */
} MC_Type;

/* ----------------------------------------------------------------------------
   -- MC Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup MC_Register_Masks MC Register Masks */
/*! \{ */

/* SRSH Bit Fields */
#define MC_SRSH_JTAG_MASK                        0x1u
#define MC_SRSH_JTAG_SHIFT                       0
#define MC_SRSH_LOCKUP_MASK                      0x2u
#define MC_SRSH_LOCKUP_SHIFT                     1
#define MC_SRSH_SW_MASK                          0x4u
#define MC_SRSH_SW_SHIFT                         2
/* SRSL Bit Fields */
#define MC_SRSL_WAKEUP_MASK                      0x1u
#define MC_SRSL_WAKEUP_SHIFT                     0
#define MC_SRSL_LVD_MASK                         0x2u
#define MC_SRSL_LVD_SHIFT                        1
#define MC_SRSL_LOC_MASK                         0x4u
#define MC_SRSL_LOC_SHIFT                        2
#define MC_SRSL_COP_MASK                         0x20u
#define MC_SRSL_COP_SHIFT                        5
#define MC_SRSL_PIN_MASK                         0x40u
#define MC_SRSL_PIN_SHIFT                        6
#define MC_SRSL_POR_MASK                         0x80u
#define MC_SRSL_POR_SHIFT                        7
/* PMPROT Bit Fields */
#define MC_PMPROT_AVLLS1_MASK                    0x1u
#define MC_PMPROT_AVLLS1_SHIFT                   0
#define MC_PMPROT_AVLLS2_MASK                    0x2u
#define MC_PMPROT_AVLLS2_SHIFT                   1
#define MC_PMPROT_AVLLS3_MASK                    0x4u
#define MC_PMPROT_AVLLS3_SHIFT                   2
#define MC_PMPROT_ALLS_MASK                      0x10u
#define MC_PMPROT_ALLS_SHIFT                     4
#define MC_PMPROT_AVLP_MASK                      0x20u
#define MC_PMPROT_AVLP_SHIFT                     5
/* PMCTRL Bit Fields */
#define MC_PMCTRL_LPLLSM_MASK                    0x7u
#define MC_PMCTRL_LPLLSM_SHIFT                   0
#define MC_PMCTRL_LPLLSM(x)                      (((uint8_t)(((uint8_t)(x))<<MC_PMCTRL_LPLLSM_SHIFT))&MC_PMCTRL_LPLLSM_MASK)
#define MC_PMCTRL_RUNM_MASK                      0x60u
#define MC_PMCTRL_RUNM_SHIFT                     5
#define MC_PMCTRL_RUNM(x)                        (((uint8_t)(((uint8_t)(x))<<MC_PMCTRL_RUNM_SHIFT))&MC_PMCTRL_RUNM_MASK)
#define MC_PMCTRL_LPWUI_MASK                     0x80u
#define MC_PMCTRL_LPWUI_SHIFT                    7

/*! \} */ /* end of group MC_Register_Masks */


